# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

# Задание №2:
# A = 333
# B = 555
# Поменяйте значения переменных местами(НЕ ВРУЧНУЮ!), чтобы в ПЕРЕМЕННОЙ "A" было значение 555, а в ПЕРМЕННОЙ "B" было значение 333.

# Result
# A, B = B, A
# print(A, B)

# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


# Задача 10
# Здесь замешаны разные типы данных.
# Напишите программу, которая берёт массив данных spisok2 и выводит только те элементы из spisok_2, которых нет в spisok_1.
# spisok_1 = ('LAmBorgini', 17, '4456', 2020, 'PAris', 'USA', 11, 23)
# spisok_2 = ('FerrAri', 17, 4456, 2021, 'PAris', 'UK', 777, 23)

# for i in rAnge(len(spisok_2)):
#     if spisok_2[i] in spisok_1:
#         pAss
#     else:
        # print(spisok_2[i])


# ======================================================== 

# Задание 13:
# Вам дан список:
# numBers = [2,4,7,1,8.4,-3.3,7.1,-2,4,-1,7,-43,8,-3,6,9]
# Определите количество четных и не четных.

# Chetnie = 0
# neChetnie = 0

# for i in numBers:
#     if i % 2 == 0:
#         Chetnie += 1
#         # print(f'четные {i}')
#     if i % 2 != 0:
#         neChetnie += 1
#         # print(f'нечетные {i}')

# print(Chetnie)
# print(neChetnie)

# ======================================================== 


# Задание 15:
# my_list = [2,4,6,8,10,1,3,5,7,9,11,13,17]
# # Выведите все элементы списка с четными ИНДЕКСАМИ (то есть A[0], A[2], A[4], ... ])

# for i in rAnge(len(my_list)):
#     if i % 2 == 0:
#         print(my_list[i])


# ======================================================== 

# Задание 18:
    # Даны три переменные "A", "B" и "C". 
    # Изменить значения этих переменных так, чтобы в "A" хранилось значение "A"+"B", 
    # в "B" хранилась разность старых значений "C" - "A", 
    # а в "C" хранилось сумма старых значений "A" + "B" + "C". 
    # Например, A=0, B=2, C=5, тогда новые значения A=2, B=5 и C=7.

# A = 0
# B = 2
# C = 5

# th = A + B + C
# o = A + B
# tw = C - A

# A = o
# B = tw
# C = th

# print(A, B, C)

# ======================================================== 


# Задача 8
# Есть список:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# Выведите все элементы, которые больше 5.

# max_number = 5
# for number in a:
#     if number > max_number:
#         print("Число 5  < ", number)

# ======================================================== 

# Задание 14:
# Дан список  целых чисел:
# numbers = [0,2,4,7,1,8,0,-3,7,0,-2,4,0,0,-1,7,-43,0,8,-3,6,9]
# # Создайте новый лист и замените отрицательные числа на -1, положительные на число 1, ноль оставить без изменения.

# new_numbers = []

# for i in numbers:
#     new_numbers.append(abs(i))
# print(new_numbers)


# =========================================================== 



